In [2]:
import pandas as pd 
import numpy as nm

In [3]:
df=pd.read_csv('Agora.csv')

In [9]:
df

   Marketing Speed   Administration  Transport     Area    Profit
0       464565456.0      56465465.0  1354564.0    Dhaka   45445.0
1       546544455.0     545456456.0     5454.0      Ctg  564654.0
2        41564545.0          4545.0  4242524.0  Rangpur   56456.0
3        54146565.0           545.0    45245.0    Dhaka    5646.0
4       656465546.0           445.0        NaN  Rangpur   56465.0

In [10]:
df.isnull().sum()

Marketing Speed     0
Administration      0
Transport           1
Area                0
Profit              0
dtype: int64

In [11]:
mean=df.Transport.mean()

In [12]:
df.Transport=df.Transport.fillna(mean)

In [13]:
df

   Marketing Speed   Administration   Transport     Area    Profit
0       464565456.0      56465465.0  1354564.00    Dhaka   45445.0
1       546544455.0     545456456.0     5454.00      Ctg  564654.0
2        41564545.0          4545.0  4242524.00  Rangpur   56456.0
3        54146565.0           545.0    45245.00    Dhaka    5646.0
4       656465546.0           445.0  1411946.75  Rangpur   56465.0

In [14]:
df.isnull().sum()

Marketing Speed     0
Administration      0
Transport           0
Area                0
Profit              0
dtype: int64

# Encoding

In [16]:

df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [17]:
df.Area=df.Area.replace(['Dhaka', 'Ctg', 'Rangpur'],[3,2,1])

In [21]:
df.Area

0    3
1    2
2    1
3    3
4    1
Name: Area, dtype: int64

In [22]:
df

   Marketing Speed   Administration   Transport  Area    Profit
0       464565456.0      56465465.0  1354564.00     3   45445.0
1       546544455.0     545456456.0     5454.00     2  564654.0
2        41564545.0          4545.0  4242524.00     1   56456.0
3        54146565.0           545.0    45245.00     3    5646.0
4       656465546.0           445.0  1411946.75     1   56465.0

# Label Encoding

In [19]:
from sklearn.preprocessing import LabelEncoder

In [25]:
df=pd.read_csv('Agora.csv')

In [26]:
df

   Marketing Speed   Administration  Transport     Area    Profit
0       464565456.0      56465465.0  1354564.0    Dhaka   45445.0
1       546544455.0     545456456.0     5454.0      Ctg  564654.0
2        41564545.0          4545.0  4242524.0  Rangpur   56456.0
3        54146565.0           545.0    45245.0    Dhaka    5646.0
4       656465546.0           445.0        NaN  Rangpur   56465.0

In [20]:
label = LabelEncoder()

In [29]:
df.Area =label.fit_transform(df['Area'])

In [30]:
df

   Marketing Speed   Administration  Transport  Area    Profit
0       464565456.0      56465465.0  1354564.0     1   45445.0
1       546544455.0     545456456.0     5454.0     0  564654.0
2        41564545.0          4545.0  4242524.0     2   56456.0
3        54146565.0           545.0    45245.0     1    5646.0
4       656465546.0           445.0        NaN     2   56465.0

# One Hot Encoding

In [8]:
df=pd.read_csv('Agora.csv')

In [9]:
df

   Marketing Speed   Administration  Transport     Area    Profit
0       464565456.0      56465465.0  1354564.0    Dhaka   45445.0
1       546544455.0     545456456.0     5454.0      Ctg  564654.0
2        41564545.0          4545.0  4242524.0  Rangpur   56456.0
3        54146565.0           545.0    45245.0    Dhaka    5646.0
4       656465546.0           445.0        NaN  Rangpur   56465.0

In [12]:

pd.get_dummies(df['Area'])

   Ctg  Dhaka  Rangpur
0    0      1        0
1    1      0        0
2    0      0        1
3    0      1        0
4    0      0        1

In [14]:
pd.get_dummies(df['Area'],drop_first=True)

   Dhaka  Rangpur
0      1        0
1      0        0
2      0        1
3      1        0
4      0        1

In [15]:
new_df=df.drop('Area',axis=1)

In [16]:
new_df

   Marketing Speed   Administration  Transport    Profit
0       464565456.0      56465465.0  1354564.0   45445.0
1       546544455.0     545456456.0     5454.0  564654.0
2        41564545.0          4545.0  4242524.0   56456.0
3        54146565.0           545.0    45245.0    5646.0
4       656465546.0           445.0        NaN   56465.0

In [18]:
pd.concat([new_df,pd.get_dummies(df['Area'])],axis=1)

   Marketing Speed   Administration  Transport    Profit  Ctg  Dhaka  Rangpur
0       464565456.0      56465465.0  1354564.0   45445.0    0      1        0
1       546544455.0     545456456.0     5454.0  564654.0    1      0        0
2        41564545.0          4545.0  4242524.0   56456.0    0      0        1
3        54146565.0           545.0    45245.0    5646.0    0      1        0
4       656465546.0           445.0        NaN   56465.0    0      0        1

# Ordinal Encoder

In [4]:
df=pd.read_csv('Agora.csv')

In [5]:
df

   Marketing Speed   Administration  Transport     Area    Profit
0       464565456.0      56465465.0  1354564.0    Dhaka   45445.0
1       546544455.0     545456456.0     5454.0      Ctg  564654.0
2        41564545.0          4545.0  4242524.0  Rangpur   56456.0
3        54146565.0           545.0    45245.0    Dhaka    5646.0
4       656465546.0           445.0        NaN  Rangpur   56465.0

In [6]:
from sklearn.preprocessing import OrdinalEncoder

In [7]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [8]:
city_list=['Dhaka', 'Ctg', 'Rangpur']

In [9]:
ordinal= OrdinalEncoder()